import pandas as pd
import numpy as np

# s= pd.Series([9904312,3448737,2890451,2466052], index=["서울","부산","인천","대구"])
# print(s)
# print('1.--------------------')
# print(pd.Series(range(1,5)))
# print('2.--------------------')
# print(s.index)
# print('3.--------------------')
# print(s.values)
# print('4.--------------------')
# s.name="인구"
# s.index.name="도시"
# print(s)

# data={
#     "2015":[9904312,3448737,2890451,2466052],
#     "2010":[9631482,3393191,2632035,2431774],
#     "2005":[9762546,3512547,2517680,2456016],
#     "2000":[9853972,3655437,2466338,2473990],
#     "지역":["수도권","경상권","수도권","경상권"],
#     "2010-2015 증가율":[0.0283,0.0163,0.0982,0.0141]
# }
# columns=["지역","2015","2010","2005","2000","2010-2015 증가율"]
# index=["서울","부산","인천","대구"]
# df=pd.DataFrame(data, index=index, columns=columns)
# print(df)
# print('1-------------------')
# print(df.values)
# print('2-------------------')
# print(df.index)
# print('3-------------------')
# print(df.columns)
# print('4-------------------')
# df.index.name="도시"
# df.columns.name="특성"
# print(df)
# print('5-------------------')
# print(df.T)

# data={
#     "2015":[9904312,3448737,2890451,2466052],
#     "2010":[9631482,3393191,2632035,2431774],
#     "2005":[9762546,3512547,2517680,2456016],
#     "2000":[9853972,3655437,2466338,2473990],
#     "지역":["수도권","경상권","수도권","경상권"],
#     "2010-2015 증가율":[0.0283,0.0163,0.0982,0.0141]
# }
# columns=["지역","2015","2010","2005","2000","2010-2015 증가율"]
# index=["서울","부산","인천","대구"]
# df=pd.DataFrame(data, index=index, columns=columns)
# print(df["지역"])
# print('1.-------------------------')
# print(df[["2010","2015"]])
# print('2.-------------------------')
# print(df[["2010"]])
# print('3.-------------------------')
# print(type(df[["2010"]]))
# print('4.-------------------------')
# print(df["2010"])
# print('5.-------------------------')
# print(type(df["2010"]))
# print('6.-------------------------')
# df2=pd.DataFrame(np.arange(12).reshape(3,4))
# print(df2)
# print('7.-------------------------')
# print(df2[2])
# print('8.-------------------------')
# df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
# print(df)
# print('9.-------------------------')
# df["2005-2010 증가율"] = ((df["2010"]-df["2005"])/df["2005"]*100).round(2) #없는 컬럼은 추가 됨.
# print(df)
# print('10.-------------------------')
# del df["2010-2015 증가율"]
# print(df)
# print('11.-------------------------')
# print(df["2015"]["서울"])
# print('12.-------------------------')
# print(df[:1]) #컬럼은 인덱스 숫자로 접근 안 됨.
# print('13.-------------------------')
# print(df[1:3])
# print('14.-------------------------')
# print(df["서울":"인천"])
# print('15.-------------------------')

# df=pd.DataFrame(np.array([[1,2,3],[4,5,6]]))
# print(df)
# print('1.--------------------------')
# print(df.shape)
# print('2.--------------------------')
# print(len(df.index))
# print('3.--------------------------')
# df=pd.DataFrame({"A":[1,4,7], "B":[2,5,8], "C":[3,6,9]})
# print(df)
# print('4.--------------------------')
# print(df.iloc[0])
# print('5.--------------------------')
# print(df.loc[0])
# print('6.--------------------------')
# print(df.loc[:,'A'])
# print('7.--------------------------')
# print(df['A'])
# print('8.--------------------------')
# print(df.loc[0]['B'])
# print('9.--------------------------')
# df2=pd.DataFrame(data=np.array([[1,2,3],[4,5,6],[7,8,9]]), index=[2, 'A', 4], columns=[48,49,50])
# print(df2)
# print('10.--------------------------')
# print(df2.loc[2])
# print('11.--------------------------')
# print(df2.iloc[2])
# df2.drop(48, axis=1,inplace=True)
# print(df2)

# df=pd.read_csv('sample.csv')
# print(df)
# print(df.columns)













